{
  "AINetwork Toolkit": "AI Network is a layer 1 blockchain designed to accommodate large-scale AI models, utilizing a decentralized GPU network powered by the $AIN token, enriching AI-driven NFTs (AINFTs). The AINetwork Toolkit is a set of tools for interacting with the AINetwork Blockchain. These tools allow you to transfer AIN, read and write values, create apps, and set permissions for specific paths within the blockchain database.",
  "Alpha Vantage": "Alpha Vantage Alpha Vantage provides realtime and historical financial market data through a set of powerful and developer-friendly data APIs and spreadsheets.",
  "Amadeus Toolkit": "Amadeus Toolkit integrates LangChain with the Amadeus travel APIs, allowing LLMs to assist with travel-related tasks such as searching for flights and booking trips. For LLMs, this toolkit can be used to help users plan their travel, make decisions about flights, or provide personalized travel recommendations. LLMs can leverage the Amadeus Toolkit to query real-time travel data, check flight availability, compare prices, and suggest optimal travel options based on user preferences, improving the travel booking experience with AI-driven recommendations and automation.",
  "Apify Actor": "Apify Actors are cloud programs designed for a wide range of web scraping, crawling, and data extraction tasks. These actors facilitate automated data gathering from the web, enabling users to extract, process, and store information efficiently. Actors can be used to perform tasks like scraping e-commerce sites for product details, monitoring price changes, or gathering search engine results. They integrate seamlessly with Apify Datasets, allowing the structured data collected by actors to be stored, managed, and exported in formats like JSON, CSV, or Excel for further analysis or use.",
  "ArXivAPIWrapper": "ArXivAPIWrapper is a tool that allows access to the vast collection of scientific papers hosted on arXiv, covering fields such as physics, mathematics, computer science, and more. For LLMs, this tool can be used to retrieve and analyze academic research, access preprints, or summarize scientific papers. LLMs can leverage the ArXivAPIWrapper to provide answers based on the latest research, identify key findings in academic papers, or assist with generating citations and recommendations for further reading, enhancing the model's ability to assist with scientific and academic inquiries.",
  "AskNews": "AskNews infuses any LLM with the latest global news (or historical news), using a single natural language query. Specifically, AskNews is enriching over 300k articles per day by translating, summarizing, extracting entities, and indexing them into hot and cold vector databases. AskNews puts these vector databases on a low-latency endpoint for you. When you query AskNews, you get back a prompt-optimized string that contains all the most pertinent enrichments (e.g. entities, classifications, translation, summarization). This means that you do not need to manage your own news RAG, and you do not need to worry about how to properly convey news information in a condensed way to your LLM. AskNews is also committed to transparency, which is why our coverage is monitored and diversified across hundreds of countries, 13 languages, and 50 thousand sources. If you'd like to track our source coverage, you can visit our transparency dashboard.",
  "AWS Lambda": "Amazon AWS Lambda is a serverless computing service provided by Amazon Web Services (AWS). It helps developers to build and run applications and services without provisioning or managing servers. This serverless architecture enables you to focus on writing and deploying code, while AWS automatically takes care of scaling, patching, and managing the infrastructure required to run your applications.",
  "Azure AI Services Toolkit": "This toolkit is used to interact with the Azure AI Services API to achieve some multimodal capabilities.\nCurrently, There are five tools bundled in this toolkit:\nAzureAiServicesImageAnalysisTool: used to extract caption, objects, tags, and text from images.\nAzureAiServicesDocumentIntelligenceTool: used to extract text, tables, and key-value pairs from documents.\nAzureAiServicesSpeechToTextTool: used to transcribe speech to text.\nAzureAiServicesTextToSpeechTool: used to synthesize text to speech.\nAzureAiServicesTextAnalyticsForHealthTool: used to extract healthcare entities.",
  "Azure Cognitive Services Toolkit": "This toolkit is used to interact with the Azure Cognitive Services API to achieve some multimodal capabilities.\nCurrently, There are four tools bundled in this toolkit:\nAzureCogsImageAnalysisTool: used to extract caption, objects, tags, and text from images. (Note: this tool is not available on Mac OS yet, due to the dependency on azure-ai-vision package, which is only supported on Windows and Linux currently.)\nAzureCogsFormRecognizerTool: used to extract text, tables, and key-value pairs from documents.\nAzureCogsSpeech2TextTool: used to transcribe speech to text.\nAzureCogsText2SpeechTool: used to synthesize text to speech.\nAzureCogsTextAnalyticsHealthTool: used to extract healthcare entities.",
  "Azure Container Apps dynamic sessions": "Azure Container Apps dynamic sessions provides a secure and scalable way to run a Python code interpreter in Hyper-V isolated sandboxes. This allows your agents to run potentially untrusted code in a secure environment. The code interpreter environment includes many popular Python packages, such as NumPy, pandas, and scikit-learn. See the Azure Container App docs for more info on how sessions work.",
  "Shell (bash)": "Giving agents access to the shell is powerful (though risky outside a sandboxed environment).\n\nThe LLM can use it to execute any shell commands. A common use case for this is letting the LLM interact with your local file system.",
  "Bearly Code Interpreter": "Bearly Code Interpreter allows for remote execution of code. This makes it perfect for a code sandbox for agents, to allow for safe implementation of things like Code Interpreter.",
  "Bing Search": "Bing Search is an Azure service and enables safe, ad-free, location-aware search results, surfacing relevant information from billions of web documents. Help your users find what they're looking for from the world-wide-web by harnessing Bing's ability to comb billions of webpages, images, videos, and news with a single API call.",
  "Brave Search": "Brave Search is Brave’s independent search engine, and the default search engine for many of the Brave Browser’s 65M+ users. Brave is unique in that it has its own index of the Web—it doesn’t rely on any other search engine for its results. It’s the only independent, global-scale search engine outside of Google and Bing. (Supposedly “alternative” search engines like Yahoo or DuckDuckGo are totally reliant on Microsoft Bing).",
  "Cassandra Database Toolkit": "Apache Cassandra® is a widely used database for storing transactional application data. The introduction of functions and >tooling in Large Language Models has opened up some exciting use cases for existing data in Generative AI applications.\n\nThe Cassandra Database toolkit enables AI engineers to integrate agents with Cassandra data efficiently, offering the following features:\n\nFast data access through optimized queries. Most queries should run in single-digit ms or less.\nSchema introspection to enhance LLM reasoning capabilities\nCompatibility with various Cassandra deployments, including Apache Cassandra®, DataStax Enterprise™, and DataStax Astra™\nCurrently, the toolkit is limited to SELECT queries and schema introspection operations. (Safety first)",
  "CDP": "CDP consolidates customer data from multiple sources into a single, unified view. For LLMs, this tool enables access to rich customer information, which can be used to deliver personalized and context-aware responses. LLMs can leverage CDP data for tasks like personalized customer support, creating tailored recommendations, and generating insights based on user behavior. This integration allows LLMs to offer real-time, relevant interactions by considering a customer’s past interactions, preferences, and activities.",
  "ClickUp Toolkit": "ClickUp is an all-in-one productivity platform that provides small and large teams across industries with flexible and customizable work management solutions, tools, and functions.\n\nIt is a cloud-based project management solution for businesses of all sizes featuring communication and collaboration tools to help achieve organizational goals.",
  "Cogniswitch Toolkit": "CogniSwitch is used to build production ready applications that can consume, organize and retrieve knowledge flawlessly. Using the framework of your choice, in this case Langchain, CogniSwitch helps alleviate the stress of decision making when it comes to, choosing the right storage and retrieval formats. It also eradicates reliability issues and hallucinations when it comes to responses that are generated.",
  "Connery Toolkit and Tools": "Connery Toolkit and Tools provide a set of tools for building and managing conversational AI systems, focusing on tasks such as natural language understanding, dialogue management, and user interaction. For LLMs, this toolkit can be used to enhance conversational capabilities, automate dialogue workflows, and integrate with external systems to create dynamic, context-aware interactions. LLMs can leverage the Connery Toolkit to facilitate more sophisticated, intelligent conversations, enabling personalized, efficient, and contextually relevant responses while improving overall user engagement.",
  "Dall-E Image Generator": "OpenAI Dall-E are text-to-image models developed by OpenAI using deep learning methodologies to generate digital images from natural language descriptions, called \"prompts\".",
  "Dappier": "Dappier connects any LLM or your Agentic AI to real-time, rights-cleared, proprietary data from trusted sources, making your AI an expert in anything. Our specialized models include Real-Time Web Search, News, Sports, Financial Stock Market Data, Crypto Data, and exclusive content from premium publishers. Explore a wide range of data models in our marketplace at marketplace.dappier.com.\n\nDappier delivers enriched, prompt-ready, and contextually relevant data strings, optimized for seamless integration with LangChain. Whether you're building conversational AI, recommendation engines, or intelligent search, Dappier's LLM-agnostic RAG models ensure your AI has access to verified, up-to-date data—without the complexity of building and managing your own retrieval pipeline.",
  "Databricks Unity Catalog (UC)": "Databricks Unity Catalog (UC) is a data governance and management tool that helps organizations manage and organize their data assets across various Databricks workspaces. For LLMs, Unity Catalog can be used to access, query, and manage structured and unstructured data stored in Databricks, ensuring that models can retrieve and process data in a secure and organized manner. LLMs can leverage Unity Catalog for tasks like data discovery, compliance monitoring, or generating insights from datasets, enabling efficient data handling and governance in large-scale machine learning workflows.",
  "DataForSEO": "DataForSeo provides comprehensive SEO and digital marketing data solutions via API.\n\nThe DataForSeo API retrieves SERP from the most popular search engines like Google, Bing, Yahoo. It also allows to >get SERPs from different search engine types like Maps, News, Events, etc.",
  "Dataherald": "Dataherald is a tool that helps gather and analyze data from various online sources to create structured datasets for decision-making and insights. For LLMs, it can be used to aggregate real-time or historical data from multiple platforms, enabling models to generate data-driven responses. LLMs can utilize Dataherald to access up-to-date information, track trends, and enhance their outputs with data gathered from diverse sources, making their responses more accurate and informed.",
  "DuckDuckGo Search": "DuckDuckGo Search is a privacy-focused search engine that provides anonymous web search results without tracking user data. For LLMs, DuckDuckGo Search can be used to retrieve real-time, privacy-conscious information from a wide range of sources. LLMs can leverage this tool to provide up-to-date answers to queries, track trends, or gather insights while ensuring user privacy by not collecting personal data. This enhances the model's ability to generate accurate, unbiased responses based on the latest web content.",
  "Discord": "Discord (as a tool for LLM) enables integration with the Discord platform, allowing LLMs to interact with users in text or voice channels within Discord servers. For LLMs, this tool can be used to automate responses, manage user interactions, provide real-time answers to questions, and perform tasks like moderation or content management within the server. LLMs can leverage Discord to assist with customer support, community engagement, or facilitate interactions in a social or professional setting, providing dynamic and context-sensitive responses based on user input in the Discord environment.",
  "E2B Data Analysis": "E2B Data Analysis focuses on extracting, processing, and analyzing data from end-to-end business processes to provide actionable insights. For LLMs, this tool helps integrate and analyze large sets of business data, enabling models to generate insights or make predictions based on comprehensive data from various stages of business operations. LLMs can use E2B Data Analysis to offer data-driven recommendations, optimize workflows, and provide detailed reports based on real-time or historical business performance.",
  "Eden AI": "Eden AI is a platform that provides access to a variety of AI services and APIs, including tools for machine learning, natural language processing, and other AI-driven tasks. For LLMs, this tool can be used to integrate different AI capabilities, such as language models, image recognition, or predictive analytics, into applications. LLMs can leverage Eden AI to enhance their functionality by incorporating external AI services, enabling more sophisticated and diverse interactions, such as sentiment analysis, text generation, or complex data processing.",
  "ElevenLabs Text2Speech": "ElevenLabs Text2Speech is a tool that converts written text into natural-sounding speech using advanced speech synthesis technology. For LLMs, this tool can be used to generate spoken responses from text, allowing the model to interact with users via voice. LLMs can leverage ElevenLabs Text2Speech to provide more engaging, multimodal interactions, enabling voice-based communication in applications such as virtual assistants, accessibility tools, or customer service bots, enhancing user experience with high-quality speech output.",
  "Exa Search": "Exa is a search engine fully designed for use by LLMs. Search for documents on the internet using natural language queries, then retrieve cleaned HTML content from desired documents.\n\nUnlike keyword-based search (Google), Exa's neural search capabilities allow it to semantically understand queries and return relevant documents. For example, we could search \"fascinating article about cats\" and compare the search results from Google and Exa. Google gives us SEO-optimized listicles based on the keyword \"fascinating\". Exa just works.",
  "File System": "File System refers to the method and structure used by an operating system to store, organize, and manage data on storage devices like hard drives, SSDs, or cloud storage. For LLMs, a file system can be used to access and manage large datasets, model files, and other resources needed for processing and training. LLMs can interact with the file system to read input data, store results, load pre-trained models, or manage logs and configurations, allowing seamless integration with data storage for tasks like file processing, model evaluation, and data retrieval.",
  "FinancialDatasets Toolkit": "The financial datasets stock market API provides REST endpoints that let you get financial data for 16,000+ tickers spanning 30+ years.",
  "FMP Data": "Access financial market data through natural language queries.",
  "Github Toolkit": "The Github toolkit contains tools that enable an LLM agent to interact with GitHub.",
  "Gmail Toolkit": "Gmail Toolkit interacts with the Gmail API to read messages, draft and send emails, and perform other email-related tasks. For LLMs, this toolkit can be used to automate email management, classify emails, or generate smart replies based on the content of incoming messages. LLMs can leverage the Gmail Toolkit to streamline tasks like responding to emails, sorting messages into folders, and generating summaries or follow-ups, making email communication more efficient and personalized.n",
  "Golden Query": "Golden provides a set of natural language APIs for querying and enrichment using the Golden Knowledge Graph e.g. queries such as: Products from OpenAI, Generative ai companies with series a funding, and rappers who invest can be used to retrieve structured data about relevant entities.",
  "Google Books": "Integration details: The Google Books tool that supports the ReAct pattern and allows you to search the Google Books API. Google Books is the largest API in the world that keeps track of books in a curated manner. It has over 40 million entries, which can give users a significant amount of data.\nTool features, Currently the tool has the following capabilities:\nGathers the relevant information from the Google Books API using a key word search,\nFormats the information into a readable output, and return the result to the agent.",
  "Google Cloud Text-to-Speech": "Google Cloud Text-to-Speech enables developers to synthesize natural-sounding speech with 100+ voices, available in multiple languages and variants. It applies DeepMind’s groundbreaking research in WaveNet and Google’s powerful neural networks to deliver the highest fidelity possible.\n\nIt supports multiple languages, including English, German, Polish, Spanish, Italian, French, Portuguese, and Hindi.",
  "Google Finance": "Google Finance provides access to real-time and historical financial data, including stock prices, market trends, and financial news. For LLMs, this tool can be used to retrieve up-to-date financial information, analyze stock performance, or generate insights on market trends. LLMs can leverage Google Finance to answer questions related to stock prices, provide financial summaries, or track specific market conditions, helping users make informed decisions based on the latest financial data.",
  "Google Imagen": "Imagen on Vertex AI brings Google's state of the art image generative AI capabilities to application developers. With Imagen on Vertex AI, application developers can build next-generation AI products that transform their user's imagination into high quality visual assets using AI generation, in seconds.",
  "Google Jobs": "Google Jobs is a tool that aggregates job listings from various sources, providing a comprehensive search engine for employment opportunities. For LLMs, this tool can be used to retrieve real-time job postings, analyze career trends, and offer personalized job recommendations based on specific criteria such as location, job title, or skills. LLMs can leverage Google Jobs to assist users in finding relevant job opportunities, track market trends, and provide insights on the job market, enhancing the user experience by offering targeted career advice and recommendations.",
  "Google Lens": "Google Lens is a visual search tool that allows users to search for information based on images, identifying objects, text, landmarks, and more. For LLMs, this tool can be used to analyze and interpret images, extract text from pictures (such as scanned documents or labels), and provide contextual information based on visual content. LLMs can leverage Google Lens to enhance their ability to answer image-based queries, offer insights about objects or locations in pictures, and assist with tasks like translation or identifying items in photos, making the interaction more dynamic and multimodal.",
  "Google Places": "Google Places is a tool that provides detailed information about geographic locations, such as businesses, landmarks, and points of interest. For LLMs, Google Places can be used to retrieve real-time data about places, including their names, addresses, phone numbers, reviews, and geographical coordinates. LLMs can integrate Google Places to offer location-based recommendations, find nearby services, or assist in navigating to a specific place by using the data to answer queries about local businesses, attractions, or venues.",
  "Google Scholar": "Google Scholar is a freely accessible web search engine that indexes the full text or metadata of scholarly articles across various disciplines. It provides access to academic papers, theses, books, conference proceedings, and patents.",
  "Google Search": "Google Search is a tool that allows you to retrieve real-time search results from the Google search engine. For LLMs, Google Search can be used to gather the latest information on any given topic, pulling in results from a wide range of sources including websites, news articles, blogs, and more. LLMs can use Google Search to provide up-to-date responses, track trends, answer specific queries based on recent content, and generate more relevant and informed responses by leveraging real-time data from the web.",
  "Google Serper": "Google Serper is a tool that offers a conversational search engine, allowing users to query Google in a more interactive and human-like manner. For LLMs, Google Serper can be used to retrieve real-time search results and integrate them into conversations. LLMs can leverage Serper to answer queries by accessing up-to-date web content, provide more detailed and context-aware responses, or gather relevant information from various sources to enhance their output. This integration allows LLMs to offer dynamic, real-time, and highly relevant answers based on the latest web data.",
  "Google Trends": "This tool allows you to retrieve and analyze trending search data from Google Trends. This tool can be particularly useful for tracking real-time public interest and popular topics based on search trends.",
  "GraphQL": "GraphQL is a query language for APIs and a runtime for executing those queries against your data. GraphQL provides a complete and understandable description of the data in your API, gives clients the power to ask for exactly what they need and nothing more, makes it easier to evolve APIs over time, and enables powerful developer tools.",
  "Human as a tool": "Human as a Tool refers to the concept of leveraging human expertise, intuition, or decision-making abilities in conjunction with automated systems like LLMs. For LLMs, humans act as a tool to provide domain-specific knowledge, refine model outputs, and guide complex decision-making processes. LLMs can collaborate with human input to improve accuracy, context-awareness, and overall response quality, particularly in areas that require nuanced judgment or creativity. This combination of human expertise and machine capabilities enhances the performance of LLMs in dynamic or specialized scenarios.",
  "IFTTT WebHooks": "IFTTT WebHooks allows users to create custom automation by triggering actions across various apps and services using web requests. For LLMs, IFTTT WebHooks can be used to integrate the model with different online platforms, enabling it to trigger actions based on specific events or conditions. LLMs can leverage IFTTT WebHooks to automate tasks like sending notifications, updating records, or activating other services in response to queries, enhancing their interactivity and ability to perform cross-platform automation.",
  "Infobip": "Infobip is a cloud communication platform that enables businesses to engage with customers through various channels, including SMS, email, voice, and messaging apps. For LLMs, this tool can be used to automate customer interactions, send personalized messages, or manage communication workflows. LLMs can leverage Infobip to assist with customer support, deliver real-time notifications, handle inquiries across multiple channels, and improve user engagement by integrating advanced conversational capabilities, ensuring efficient communication within businesses.",
  "Ionic Shopping Tool": "Ionic is a plug and play ecommerce marketplace for AI Assistants. By including the Ionic Tool in your agent, you are effortlessly providing your users with the ability to shop and transact directly within your agent, and you'll get a cut of the transaction.",
  "Jenkins": "Jenkins is an automation server commonly used for continuous integration and continuous delivery (CI/CD) of software projects. For LLMs, Jenkins can be used to automate tasks like data processing, model training, and deployment workflows. LLMs can interact with Jenkins to trigger automated pipelines, manage model versions, and monitor the performance of models over time. This integration allows LLMs to support DevOps workflows, automate testing, and continuously deploy updates, ensuring that models and applications stay up to date with minimal manual intervention.",
  "Jina Search": "Jina Search is an AI-powered search engine that focuses on enabling search capabilities for multimodal data, such as text, images, audio, and video. For LLMs, this tool can be used to enhance the model’s ability to process and retrieve information from diverse data types beyond just text. LLMs can leverage Jina Search to perform more complex queries, like searching through images, videos, or audio files, and generate insights or responses based on the results, making the search process more dynamic and versatile.",
  "Jira Toolkit": "Jira Toolkit is a set of tools for managing and tracking software development projects, tasks, and workflows using the Jira platform. For LLMs, the Jira Toolkit can be used to interact with Jira issues, retrieve project details, and manage task workflows. LLMs can leverage this toolkit to automate tasks such as creating or updating issues, generating status reports, summarizing progress, and providing real-time updates on project activities. It enhances the model's ability to assist in project management, ensuring that workflows are efficiently tracked and managed within Jira.",
  "JSON Toolkit": "JSON Toolkit is a tool designed to work with JSON (JavaScript Object Notation) data, enabling tasks like parsing, validating, and manipulating JSON structures. For LLMs, this tool can be used to process and transform structured data, such as user inputs or external data sources, into a format that the model can work with efficiently. LLMs can leverage the JSON Toolkit to parse complex JSON objects, extract relevant information, or generate custom JSON outputs based on user queries, enhancing the model's ability to handle structured data in real-time interactions.",
  "Lemon Agent": "Lemon Agent helps you build powerful AI assistants in minutes and automate workflows by allowing for accurate and reliable read and write operations in tools like Airtable, Hubspot, Discord, Notion, Slack and Github.",
  "LinkupSearchTool": "LinkupSearchTool is a tool designed to search job listings and career-related content, focusing on employment opportunities and market trends. For LLMs, this tool can be used to retrieve real-time job postings, analyze career trends, or provide tailored job recommendations based on specific skills, locations, or industries. LLMs can leverage LinkupSearchTool to assist users in finding job opportunities, understanding job market conditions, and offering personalized career advice, enhancing the model's utility in employment-related tasks.",
  "Memorize": "Memorize is a tool designed to help users retain and recall information through spaced repetition and personalized learning techniques. For LLMs, Memorize can be used to assist with creating, organizing, and managing study materials, helping users learn and review content more effectively. LLMs can integrate Memorize to provide personalized recommendations, quiz users on key concepts, or generate custom learning plans based on the user's progress. This helps enhance the learning experience by offering dynamic, data-driven study sessions tailored to individual needs.",
  "Mojeek Search": "Mojeek Search is a privacy-focused search engine that provides unbiased search results without tracking users or collecting personal data. For LLMs, Mojeek Search can be used to retrieve real-time web content while maintaining user privacy. LLMs can leverage Mojeek Search to provide relevant answers to queries, track trends, and gather insights from a wide range of sources, ensuring that the model offers privacy-conscious and up-to-date information without compromising user data.",
  "MultiOn Toolkit": "MultiOn Toolkit is a set of tools designed to support collaborative communication and workflow management across teams. For LLMs, the MultiOn Toolkit can be used to streamline team collaboration by providing insights from real-time communication, task management, and data sharing. LLMs can assist in managing conversations, summarizing discussions, or extracting actionable items from group interactions, making workflows more efficient. It also helps automate tasks like meeting notes, action item tracking, and collaborative decision-making, improving productivity and team coordination.",
  "NASA Toolkit": "NASA Toolkit is a collection of tools and resources developed by NASA to support space exploration, research, and data analysis. For LLMs, the NASA Toolkit can be used to access scientific data, mission logs, and technical information related to space exploration. LLMs can leverage this toolkit to answer questions about space missions, astronomy, and space technologies, or provide data-driven insights based on NASA’s vast collection of space-related knowledge. It enables LLMs to assist with research, provide detailed explanations, and offer real-time data from space-related projects.",
  "Nuclia Understanding": "Nuclia automatically indexes your unstructured data from any internal and external source, providing optimized search results and generative answers. It can handle video and audio transcription, image content extraction, and document parsing.\n\nThe Nuclia Understanding API supports the processing of unstructured data, including text, web pages, documents, and audio/video contents. It extracts all texts wherever it is (using speech-to-text or OCR when needed), it identifies entities, it also extracts metadata, embedded files (like images in a PDF), and web links. It also provides a summary of the content.",
  "NVIDIA Riva: ASR and TTS": "NVIDIA Riva is a GPU-accelerated multilingual speech and translation AI software development kit for building fully customizable, real-time conversational AI pipelines—including automatic speech recognition (ASR), text-to-speech (TTS), and neural machine translation (NMT) applications—that can be deployed in clouds, in data centers, at the edge, or on embedded devices.",
  "Office365 Toolkit": "Office365 Toolkit provides tools for integrating with Microsoft Office 365 services, including applications like Word, Excel, Outlook, and Teams. For LLMs, this toolkit can be used to automate tasks within Office 365, such as creating and editing documents, managing emails, organizing calendar events, or interacting with collaborative tools like Teams. LLMs can leverage the Office365 Toolkit to assist with tasks like drafting emails, generating reports, scheduling meetings, or managing workflows, enhancing productivity and streamlining office tasks within the Office 365 ecosystem.",
  "Natural Language API Toolkits": "Natural Language API Toolkits provide a set of tools for processing and analyzing human language, enabling tasks such as sentiment analysis, entity recognition, text classification, translation, and summarization. For LLMs, these toolkits can enhance language understanding by offering capabilities to interpret, analyze, and manipulate text in real-time. LLMs can use Natural Language API Toolkits to process user input, extract meaningful insights, generate summaries, or perform specific language tasks like text categorization and language translation, thereby improving the model's ability to handle complex linguistic tasks effectively.",
  "OpenWeatherMap": "OpenWeatherMap provides weather data, including current conditions, forecasts, and historical data, through an API. For LLMs, OpenWeatherMap can be used to retrieve real-time weather information and forecasts, allowing the model to generate responses related to weather conditions, predictions, or climate trends. LLMs can integrate OpenWeatherMap to provide users with accurate, location-specific weather updates or answer questions about weather patterns, enhancing the model's ability to assist in tasks that involve environmental or outdoor planning.",
  "Oracle AI Vector Search: Generate Summary": "Oracle AI Vector Search is designed for Artificial Intelligence (AI) workloads that allows you to query data based on semantics, rather than keywords. One of the biggest benefits of Oracle AI Vector Search is that semantic search on unstructured data can be combined with relational search on business data in one single system. This is not only powerful but also significantly more effective because you don't need to add a specialized vector database, eliminating the pain of data fragmentation between multiple systems.",
  "Pandas Dataframe": "Pandas DataFrame is a data structure in Python used for storing and manipulating tabular data. For LLMs, a Pandas DataFrame can be utilized to process, analyze, and summarize large datasets efficiently. LLMs can interact with DataFrames to perform operations such as filtering, grouping, aggregating, and transforming data, enabling the model to generate insights, statistics, or reports based on structured data. This integration allows LLMs to assist with data analysis tasks, providing valuable information or recommendations from large datasets in a seamless manner.",
  "Passio NutritionAI": "Passio NutritionAI is a tool designed to provide AI agents with advanced capabilities related to nutrition analysis and recommendations. For LLMs, this tool can be used to analyze food data, suggest nutrition plans, or answer queries about healthy eating based on specific dietary needs. LLMs can leverage Passio NutritionAI to assist users with personalized nutrition advice, track nutrient intake, and generate meal plans, enhancing the model's ability to support health and wellness-related queries.",
  "PaymanAI": "PaymanAI is a tool designed to provide AI-driven solutions for financial services, including tasks like expense management, budgeting, and financial analysis. For LLMs, this tool can be used to assist with financial planning, track spending, or offer personalized budgeting advice based on user data. LLMs can leverage PaymanAI to analyze financial transactions, generate financial insights, or provide recommendations for managing personal finances, helping users make informed decisions and improve their financial well-being.",
  "Permit": "Permit is an access control platform that provides fine-grained, real-time permission management using various models such as RBAC, ABAC, and ReBAC. It enables organizations to enforce dynamic policies across their applications, ensuring that only authorized users can access specific resources.",
  "PlayWright Browser Toolkit": "Playwright is an open-source automation tool developed by Microsoft that allows you to programmatically control and automate web browsers. It is designed for end-to-end testing, scraping, and automating tasks across various web browsers such as Chromium, Firefox, and WebKit.\nThis toolkit is used to interact with the browser. PlayWright Browser toolkits let your agent navigate the web and interact with dynamically rendered sites.",
  "Polygon IO Toolkit and Tools": "Polygon IO Toolkit and Tools provide access to financial data APIs, including real-time stock prices, historical market data, and financial news. For LLMs, this toolkit can be used to retrieve and analyze stock market data, track market trends, or generate financial insights. LLMs can leverage Polygon IO to answer financial queries, provide up-to-date stock prices, analyze trends, and generate investment recommendations based on real-time market information, making the model a valuable tool for financial analysis and decision-making.",
  "PowerBI Toolkit": "PowerBI Toolkit is a collection of tools that integrates with Microsoft Power BI, enabling users to create, manage, and share interactive data visualizations and business intelligence reports. For LLMs, the PowerBI Toolkit can be used to query data from Power BI reports, extract key insights, and assist in data analysis by interacting with visual dashboards. LLMs can leverage this toolkit to summarize complex visualizations, generate custom reports, and provide recommendations based on the visualized data, helping users make data-driven decisions through rich, interactive reports.",
  "Prolog": "Prolog is a logic programming language used for solving problems related to artificial intelligence and computational linguistics, focusing on rule-based reasoning and symbolic computation. For LLMs, Prolog can be used to handle tasks that require logical inference, knowledge representation, and problem-solving through rules. LLMs can leverage Prolog to reason about complex relationships, answer queries based on logical rules, or assist in generating solutions to problems involving constraints and logic, enhancing the model's ability to perform structured reasoning and decision-making tasks.",
  "PubMed": "PubMed is a comprehensive database that contains over 35 million citations for biomedical literature, including articles, research papers, and clinical studies. For LLMs, this tool can be used to access up-to-date scientific research, retrieve scholarly articles, and provide evidence-based answers to health, medical, or scientific queries. LLMs can leverage PubMed to assist in answering complex biomedical questions, summarizing recent studies, or providing citations and references for scientific topics, enhancing the model's ability to support research and medical inquiries with authoritative sources.",
  "Python REPL": "Python REPL provides a simple interactive environment to execute Python commands. For LLMs, this tool can be used to dynamically run Python code, perform real-time calculations, or execute code snippets on the fly. LLMs can leverage the Python REPL for tasks like debugging, testing, or processing user input through custom Python code, providing more flexible and interactive capabilities within the conversation.",
  "Reddit Search": "Reddit Search is a tool that allows you to search through Reddit’s vast collection of posts and discussions. It's especially useful for gathering community-driven content, opinions, and insights on a wide range of topics. Reddit hosts discussions in the form of threads, where users engage in conversations, share news, ask questions, and exchange ideas on various subjects.",
  "Requests Toolkit": "Requests Toolkit is a tool designed to simplify the process of making HTTP requests, allowing LLMs to interact with APIs and web services. For LLMs, this toolkit can be used to send and receive data from external services, retrieve web content, or access remote APIs in real time. LLMs can leverage the Requests Toolkit to fetch information from online sources, integrate with third-party APIs, or automate web interactions, making it easier to enhance responses with up-to-date information and provide dynamic, API-driven functionality.",
  "Riza Code Interpreter": "Riza Code Interpreter is a tool that allows LLMs to execute and interpret code in real-time, enabling the model to run and analyze code snippets, solve computational problems, and provide programming-related insights. For LLMs, this tool can be used to execute programming code, debug errors, or demonstrate algorithmic solutions in various programming languages. LLMs can leverage the Riza Code Interpreter to assist with coding tasks, answer technical programming questions, or generate and test code dynamically, enhancing the model's ability to help with software development and computational tasks.",
  "Robocorp Toolkit": "Robocorp Toolkit is a platform that extends the capabilities of AI agents by automating tasks, integrating with external systems, and creating robotic process automation (RPA) workflows. For LLMs, this toolkit can be used to automate repetitive tasks, interact with external applications, and enhance the agent’s ability to perform complex workflows. LLMs can leverage Robocorp to assist in tasks like data entry, system integration, or process automation, enabling AI agents to handle a wider range of activities and improve operational efficiency.",
  "Salesforce": "Salesforce is a customer relationship management (CRM) platform that provides tools for managing customer data, sales processes, marketing automation, and customer service operations. For LLMs, Salesforce can be used to access customer information, automate sales workflows, generate reports, or assist with customer support tasks. LLMs can leverage Salesforce to provide real-time insights on customer interactions, help with lead generation, suggest personalized marketing strategies, or automate routine CRM tasks, enhancing the overall efficiency and effectiveness of sales and customer service operations.",
  "SceneXplain": "SceneXplain is a tool designed to analyze and interpret images, providing descriptions or explanations of the contents within a scene. For LLMs, this tool can be used to generate detailed textual descriptions of images, identify objects or actions, and answer questions based on visual content. LLMs can leverage SceneXplain to enhance image-related queries, offering context-aware explanations or insights about the scene in the image, making the interaction more dynamic and allowing the model to engage in multimodal tasks.",
  "ScrapeGraph": "ScrapeGraph provides a tool for web scraping and extracting structured data from websites, especially useful for gathering information from complex, dynamic web pages. For LLMs, this tool can be used to automatically collect data from websites, process and organize the extracted content, and present it in a structured format. LLMs can leverage ScrapeGraph to enhance their ability to retrieve and analyze web data, enabling the model to answer queries that require specific data extracted from the web, or use this information for further processing and insights.",
  "SearchApi": "SearchAPI is a tool that provides a way to query various search engines and databases to retrieve information based on user input. For LLMs, SearchAPI can be used to access a wide range of web content, including websites, articles, news, and other searchable databases. LLMs can leverage SearchAPI to pull in real-time, up-to-date data and incorporate this information into their responses, allowing the model to answer queries with fresh content, track trends, or provide more accurate answers based on the latest available data.",
  "SearxNG Search": "SearxNG Search is an open-source metasearch engine that aggregates results from various search engines while respecting user privacy. For LLMs, SearxNG can be used to retrieve diverse and unbiased search results from multiple sources without tracking or profiling users. LLMs can leverage SearxNG Search to provide accurate, privacy-conscious, and up-to-date information by combining results from multiple search engines, enhancing the model’s ability to generate well-informed responses based on a broad range of data.",
  "Semantic Scholar API Tool": "Semantic Scholar API Tool provides access to scholarly papers, citations, and academic research data from the Semantic Scholar database. For LLMs, this tool can be used to retrieve detailed information about academic articles, authors, and research trends. LLMs can leverage the Semantic Scholar API to answer questions about scientific topics, summarize research papers, or provide citation-based insights, enhancing the model's ability to assist in academic research and data-driven discussions with access to a rich repository of scholarly knowledge.",
  "SerpAPI": "SerpAPI is a powerful API that allows you to retrieve real-time search engine results, including Google, Bing, Yahoo, and more, in a structured and accessible format. It handles web scraping for you, meaning you don’t need to worry about manually scraping search engines.",
  "Slack Toolkit": "Slack Toolkit is a collection of tools and integrations designed to enhance collaboration and communication within the Slack platform. For LLMs, the Slack Toolkit can be used to automate tasks, manage messages, and analyze conversations within Slack channels. LLMs can interact with Slack to provide real-time responses, summarize discussions, extract key insights, or automate workflows such as reminders, notifications, and task assignments, improving productivity and streamlining team collaboration.",
  "Spark SQL Toolkit": "Spark SQL Toolkit is a set of tools for working with structured data using Apache Spark, allowing users to query and analyze large datasets efficiently. For LLMs, Spark SQL Toolkit can be used to process and analyze big data, enabling the model to execute complex SQL queries on large datasets and return meaningful results. LLMs can leverage Spark SQL to handle data processing tasks, generate reports, or provide insights based on structured data, making it easier to analyze large volumes of information in real-time or on-demand.",
  "SQLDatabase Toolkit": "SQLDatabase Toolkit provides a set of tools for interacting with and managing SQL databases, enabling users to execute queries, manipulate data, and manage database schemas. For LLMs, this toolkit can be used to access structured data stored in relational databases, allowing models to run queries, retrieve data, and generate insights based on the information. LLMs can leverage SQLDatabase Toolkit to assist with tasks like data extraction, generating reports, summarizing large datasets, or answering queries related to the data stored in SQL databases, improving decision-making through structured data analysis.\n\n\n\n\n\n\n\n",
  "StackExchange": "Stack Exchange is a network of question-and-answer (Q&A) websites on topics in diverse fields, each site covering a specific topic, where questions, answers, and users are subject to a reputation award process. The reputation system allows the sites to be self-moderating.",
  "Steam Toolkit": "Steam is a video game digital distribution service and storefront developed by Valve Corporation. It provides game updates automatically for Valve's games, and expanded to distributing third-party titles. Steam offers various features, like game server matchmaking with Valve Anti-Cheat measures, social networking, and game streaming services.\n\nSteam is the ultimate destination for playing, discussing, and creating games.",
  "Stripe": "Stripe is a payment processing platform that allows businesses to accept payments, manage subscriptions, and handle online transactions. For LLMs, Stripe can be integrated to automate payment-related tasks, such as processing transactions, managing billing cycles, and tracking financial data. LLMs can leverage Stripe to assist with tasks like answering payment inquiries, updating subscription statuses, or generating receipts, providing real-time insights into financial transactions and helping businesses streamline their payment operations.",
  "Tavily Search": "Tavily's Search API is a search engine built specifically for AI agents (LLMs), delivering real-time, accurate, and factual results at speed.",
  "Tilores": "Tilores is a tool focused on real-time data analysis and predictive analytics, helping to track key metrics and trends. For LLMs, Tilores can be used to analyze and interpret real-time data, allowing the model to generate insights, forecasts, and data-driven recommendations. LLMs can utilize Tilores to offer predictions or perform trend analysis, improving decision-making by providing up-to-date information from a variety of data sources. This enhances the model's ability to deliver informed, actionable responses based on current data.",
  "Twilio": "Twilio Messaging Channels facilitates integrations with 3rd party messaging apps and lets you send messages through WhatsApp Business Platform (GA), Facebook Messenger (Public Beta) and Google Business Messages (Private Beta).",
  "Upstage": "Upstage is a platform or tool that focuses on creating AI-driven virtual assistants or chatbots, often tailored for customer service, engagement, or task automation. For LLMs, Upstage can be used to enhance the conversational abilities of virtual assistants by integrating advanced natural language understanding, personalization, and automation features. LLMs can leverage Upstage to offer dynamic, context-aware responses, automate repetitive tasks, and engage users more effectively by providing real-time support or recommendations based on specific user inputs.",
  "Wikidata": "Wikidata is a free and open knowledge base that acts as a central repository for structured data, supporting various Wikimedia projects like Wikipedia. For LLMs, this tool can be used to retrieve structured data, such as facts, entities, and relationships, to enhance answers with precise, reliable information. LLMs can leverage Wikidata to provide detailed, fact-based responses, perform entity recognition, or offer insights based on structured knowledge about people, places, concepts, and other topics, improving the accuracy and depth of their answers.",
  "Wikipedia": "Wikipedia is an online, open-access encyclopedia that contains vast amounts of information on a wide range of topics. For LLMs, this tool can be used to retrieve detailed articles, summaries, and references directly from Wikipedia. LLMs can leverage Wikipedia to provide accurate, factual information, generate summaries, or answer questions based on the extensive knowledge base available on the platform. It helps enhance the model's ability to offer context-rich, reliable responses from one of the largest publicly available sources of information.",
  "Wolfram Alpha": "Wolfram Alpha is a computational knowledge engine that provides answers to questions, performs calculations, and generates reports based on structured data. For LLMs, Wolfram Alpha can be used to access a vast range of factual, mathematical, scientific, and statistical information. LLMs can leverage Wolfram Alpha to perform complex calculations, retrieve real-time data, and provide accurate answers to queries requiring specific knowledge in fields such as mathematics, science, engineering, and finance. This integration helps enhance the model's capabilities in answering technical or data-driven questions.",
  "Yahoo Finance News": "Yahoo Finance News is a tool that provides access to the latest financial news, market analysis, and updates on stocks, bonds, and other financial assets. For LLMs, this tool can be used to retrieve current financial news, track market trends, or generate insights related to economic events. LLMs can leverage Yahoo Finance News to answer queries about financial markets, summarize important news stories, and offer up-to-date financial information, helping users stay informed about economic developments and make better investment decisions.",
  "You.com Search": "You.com Search is a search engine that aggregates results from various sources, providing a personalized and efficient search experience. For LLMs, You.com Search can be used to retrieve relevant, real-time web content tailored to the user’s preferences, enhancing the model's ability to generate accurate and up-to-date responses. LLMs can leverage You.com Search to provide dynamic, information-rich answers by integrating search results from a wide range of web sources, helping users find information more effectively.",
  "YouTube": "YouTube tool provides access to video content, including video descriptions, titles, and metadata, for tasks such as content analysis, trend tracking, and information retrieval. For LLMs, this tool can be used to extract and process video data, enabling the model to summarize video content, answer queries related to videos, or provide insights based on video topics. LLMs can integrate YouTube as a tool to enhance their ability to deliver multimedia-based responses and provide real-time information by leveraging video content in conjunction with other data sources.",
  "ZenGuard AI": "The ZenGuard AI provides ultrafast guardrails to protect your GenAI application from:\nPrompts Attacks,\nVeering of the pre-defined topics,\nPII, sensitive info, and keywords leakage,\nToxicity."
}